DataProcessors/БНС_ЗаполнениеМаркировкиДокументыОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>БНС_ЗаполнениеМаркировкиДокументыОтгрузки</Name>
			<Comment>v2026.07.12.3</Comment>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДокументыОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодыЗаполнены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКодов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ОписаниеНоменклатурыИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОписаниеНоменклатурыИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникОписанияНоменклатурыИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияТоваровУслуг</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БНС_ОстаткиИСМП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШтрихкодыУпаковок</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/БНС_ЗаполнениеМаркировкиДокументыОтгрузки/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура УСТАРЕВШАЯ_ЗаполнитьДокументыНаСервере()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	РеализацияТоваровУслуг.Ссылка КАК Документ,
	//               |	РеализацияТоваровУслуг.Контрагент КАК Контрагент
	//               |ИЗ
	//               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//               |ГДЕ
	//               |	РеализацияТоваровУслуг.Проведен
	//               |	И РеализацияТоваровУслуг.Дата МЕЖДУ &Дата1 И &Дата2
	//               |	И РеализацияТоваровУслуг.Товары.Номенклатура В
	//               |			(ВЫБРАТЬ
	//               |				Номенклатура.Ссылка КАК Ссылка
	//               |			ИЗ
	//               |				Справочник.Номенклатура КАК Номенклатура
	//               |			ГДЕ
	//               |				НЕ Номенклатура.ПометкаУдаления
	//               |				И НЕ Номенклатура.УдалитьВидМаркировки = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка))
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Документ
	//               |АВТОУПОРЯДОЧИВАНИЕ";
	//Запрос.УстановитьПараметр("Дата1", НачалоДня(ПериодЗаполнения.ДатаНачала));
	//Запрос.УстановитьПараметр("Дата2", КонецДня(ПериодЗаполнения.ДатаОкончания));

	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Объект.ДокументыОтгрузки.Очистить();
	//
	//Пока Выборка.Следующий() Цикл;
	//	
	//	НоваяСтрока = Объект.ДокументыОтгрузки.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	//	НоваяСтрока.КодыЗаполнены   = Выборка.Документ.ШтрихкодыУпаковок.Количество() > 0;
	//	НоваяСтрока.КоличествоКодов = Выборка.Документ.ШтрихкодыУпаковок.Количество();
	//	
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка КАК Документ,
	               |	РеализацияТоваровУслуг.Контрагент КАК Контрагент
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Проведен
	               |	И РеализацияТоваровУслуг.Дата МЕЖДУ &Дата1 И &Дата2
	               |	И РеализацияТоваровУслуг.Товары.Номенклатура В
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				ОписаниеНоменклатурыИС.Номенклатура КАК Номенклатура
	               |			ИЗ
	               |				РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Документ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ПериодЗаполнения.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2", КонецДня(ПериодЗаполнения.ДатаОкончания));

	Выборка = Запрос.Выполнить().Выбрать();
	
	Объект.ДокументыОтгрузки.Очистить();
	
	Пока Выборка.Следующий() Цикл;
		
		НоваяСтрока = Объект.ДокументыОтгрузки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.КодыЗаполнены   = Выборка.Документ.ШтрихкодыУпаковок.Количество() > 0;
		НоваяСтрока.КоличествоКодов = Выборка.Документ.ШтрихкодыУпаковок.Количество();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументы(Команда)
	ЗаполнитьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодЗаполнения.ДатаНачала    = НачалоМесяца(ТекущаяДатаСеанса());
	ПериодЗаполнения.ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьКодыМаркировкиВДокументахНаСервере()
	
	МассивСтрок = Объект.ДокументыОтгрузки.НайтиСтроки(Новый Структура("КодыЗаполнены", Истина));
	Для Каждого Строка Из МассивСтрок Цикл
		
		лОбъект = Строка.Документ.ПолучитьОбъект();
		лОбъект.ШтрихкодыУпаковок.Очистить();
		
		Попытка
			лОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			
		КонецПопытки;
		
		Строка.КодыЗаполнены   = Ложь;
		Строка.КоличествоКодов = 0;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКодыМаркировкиВДокументах(Команда)
	ОчиститьКодыМаркировкиВДокументахНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКодыМаркировкиВДокументахНаСервере()
	
	МассивСтрок = Объект.ДокументыОтгрузки.НайтиСтроки(Новый Структура("КодыЗаполнены", Ложь));
	Для Каждого Строка Из МассивСтрок Цикл
		
		СтруктураРезультатов = БНС_ОбщегоНазначенияГИСМ.ПолучитьСвободнуюМаркировку(Строка.Документ);
		
		ТзнОбщие = СтруктураРезультатов.ТзнОбщий;
		ТзнКоды  = СтруктураРезультатов.ТзнКоды;
		
		НетКодов = Ложь;
		
		лОбъект = Строка.Документ.ПолучитьОбъект();
		//лОбъект.Ответственный = Справочники.Пользователи.НайтиПоНаименованию("edo");
		
		Для Каждого СтрПроверка Из ТзнОбщие Цикл
			
			Если СтрПроверка.Остаток >= СтрПроверка.Количество Тогда
				
				Счетчик = СтрПроверка.Количество;
				МассивКодов = ТзнКоды.НайтиСтроки(Новый Структура("Номенклатура", СтрПроверка.Номенклатура));
				Для Каждого СтрКод Из МассивКодов Цикл
					
					Если СтрКод.Остаток > 1 Тогда
						Сообщить("Упаковка, пропускаю код: " + СтрКод.ШтрихкодУпаковки);
						Продолжить;
					КонецЕсли;
					
					НоваяСтрока = лОбъект.ШтрихкодыУпаковок.Добавить();	
					НоваяСтрока.ШтрихкодУпаковки = СтрКод.ШтрихкодУпаковки;
					
					Счетчик = Счетчик - СтрКод.Остаток;
					Если Счетчик <= 0 Тогда
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				НетКодов = Истина;
				ОбщегоНазначения.СообщитьПользователю("Нет маркировки: " + Строка.Документ + ", по товару: " + СтрПроверка.Номенклатура);
				
			КонецЕсли;
				
		КонецЦикла;
		
		Если НетКодов Тогда
			Продолжить;
		КонецЕсли;
		
		
		
		Попытка
			лОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			
		КонецПопытки;
		
		Строка.КодыЗаполнены   = Истина;
		Строка.КоличествоКодов = лОбъект.ШтрихкодыУпаковок.Количество();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКодыМаркировкиВДокументах(Команда)
	ЗаполнитьКодыМаркировкиВДокументахНаСервере();
КонецПроцедуры

&НаСервере
Функция УСТАРЕВШАЯ_ПолучитьСвободнуюМаркировку(СсылкаНаОбъект)
	
	//Результат = Новый Структура;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	//               |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
	//               |ПОМЕСТИТЬ ВТ_Документ
	//               |ИЗ
	//               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	//               |ГДЕ
	//               |	НЕ РеализацияТоваровУслугТовары.Номенклатура.УдалитьВидМаркировки = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка)
	//               |	И РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	РеализацияТоваровУслугТовары.Номенклатура
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ_Документ.Номенклатура КАК Номенклатура,
	//               |	ВТ_Документ.Количество КАК Количество,
	//               |	ЕСТЬNULL(БНС_ОстаткиИСМПОстатки.КоличествоОстаток, 0) КАК Остаток
	//               |ИЗ
	//               |	ВТ_Документ КАК ВТ_Документ
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БНС_ОстаткиИСМП.Остатки КАК БНС_ОстаткиИСМПОстатки
	//               |		ПО ВТ_Документ.Номенклатура = БНС_ОстаткиИСМПОстатки.Номенклатура
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ_Документ.Номенклатура КАК Номенклатура,
	//               |	ВТ_Документ.Количество КАК Количество,
	//               |	БНС_ОстаткиИСМПОстатки.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	//               |	ЕСТЬNULL(БНС_ОстаткиИСМПОстатки.КоличествоОстаток, 0) КАК Остаток
	//               |ИЗ
	//               |	ВТ_Документ КАК ВТ_Документ
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БНС_ОстаткиИСМП.Остатки КАК БНС_ОстаткиИСМПОстатки
	//               |		ПО ВТ_Документ.Номенклатура = БНС_ОстаткиИСМПОстатки.Номенклатура
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	БНС_ОстаткиИСМПОстатки.Номенклатура,
	//               |	БНС_ОстаткиИСМПОстатки.ШтрихкодУпаковки.ДатаУпаковки
	//               |АВТОУПОРЯДОЧИВАНИЕ";
	//Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	//РезультатЗапроса = Запрос.ВыполнитьПакет();
	//
	//Результат.Вставить("ТзнОбщий", РезультатЗапроса[1].Выгрузить());
	//Результат.Вставить("ТзнКоды" , РезультатЗапроса[2].Выгрузить());
	//
	//Возврат Результат;
	
КонецФункции



&НаСервере
Процедура УстановитьОтветственногоНаСервере()
	
	Для Каждого Строка Из Объект.ДокументыОтгрузки Цикл
		
		лОбъект = Строка.Документ.ПолучитьОбъект();
		лОбъект.Ответственный = Справочники.Пользователи.НайтиПоНаименованию("edo");
		
		Попытка
			лОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтветственного(Команда)
	УстановитьОтветственногоНаСервере();
КонецПроцедуры
